* Figure these out (eventually)
** What's the proper way to install and use fonts? Sometimes we don't get italics, etc.
** add EIN (Jupyter) (https://github.com/millejoh/emacs-ipython-notebook/tree/master)
This requires `elpy`, its official python module, which is unmaintained
*** other options include this: https://github.com/nnicandro/emacs-jupyter
*** and this: https://github.com/gregsexton/ob-ipython (it looks like org-mode can actually do a lot of what jupyter does)
** TODO Compiling emacs - use Cairo and Harfbuzz for graphics
** org-roam
** github.com/jacktasia/dumb-jump
** See [[github.com/minad/corfu][corfu]] for how completion-in-region functions can be patched
** TODO is there a way to create imenu headers in a .el file? Good for jumping to a specific config section
** TODO put temporary buffers near the bottom, including *completions*, and not too big
In Info/Help, see Emacs > Windows > Displaying Buffers > Temporary Displays
** Should we move config to literate?
** TODO For =diff-hl-mode=, we need to profile performance over Tramp
Per the [[https://github.com/dgutov/diff-hl#tramp][README's]] instructions:
#+begin_quote
diff-hl should just work with
Tramp. But slow or high latency connections can cause performance
problems. If you experience such issues, customize
diff-hl-disable-on-remote to t. This will change the behavior of both
turn-on-diff-hl-mode and global-diff-hl-mode (whichever you prefer to
use).
#+end_quote

* Notes
+ `compile` is tramp-aware
+ https://xenodium.com/speeding-up-emacs-tramp-via-controlmaster/
+ The info mode index is very handy
+ In info mode, to find elisp stuff, use =d m elisp RET=; followed by =I= and then type the thing to "list" or search for
+ There's a great minimal config here: https://gitlab.com/wef/dotfiles/-/blob/master/.emacs.d.minimal/config.el
+ It looks like outline-show-all and outline-mode in general can do the code folding I've been after
+ Comments like these: https://www.reddit.com/r/emacs/comments/k4kemb/comment/gegw9ws/?utm_source=share&utm_medium=web2x&context=3 show a striking
difference of attitude from Vim (less so neovim)
+ Company has company-tng-mode (tab 'n' go) for completion with just TAB, but didn't get it working
+ Virtual environment management looks kinda stale - maybe something like this is good? https://github.com/marcwebbie/auto-virtualenv
+ dired looks incredibly powerful, but some features are confusing
+ I have no idea whether we should foray into the `flx` world: https://github.com/lewang/flx and company-flx too
+ `vertico` https://github.com/minad/vertico also looks like a compelling completion framework
+ The "flickering" sensation on Windows is likely because of a lack of "double buffering" support: https://news.ycombinator.com/item?id=12830409
+ Someone is working on dark-mode toolbars for emacs on windows: https://github.com/vsalvino/emacs
+ `term` doesn't work on Windows native Emacs build, but the Cygwin builds do support it: https://itecnote.com/tecnote/bash-m-x-term-with-emacs-on-ms-windows-error-spawning-child-process-invalid-argument/
+ To get flyspell working on Windows, had to install `aspell` and `aspell-en` with pacman
+ FIDO (Fake IDO) mode is built-in, has a vertical mode, and improves on IDO since Emacs 27, so we've switched to that
+ Fuzzy finding is tougher to find
+ =fzf= support is second class, but a couple solutions out there:
+ https://www.youtube.com/watch?v=IDkx48JwDco
+ https://github.com/bling/fzf.el
+ could try writing our own
+ =consult-find= is slow and relies on =find=
+ =find-name-dired= is also slow, synchronous, relies on =find=
+ `C-x p f` looks like the best built-in default, from project.el, but uses =git ls= to get the potential files we can visit
+ try out prot's completion config: https://www.youtube.com/watch?v=43Dg5zYPHTU
+ embark: https://github.com/oantolin/embark
+ which-key: https://github.com/justbur/emacs-which-key
+ vanilla minibuffer complete
+ consult
+ marginalia
+ Trying out org-babel with just bare python, using :python and :session, and turning off the confirm prompt
+ Using defined functions instead of lambdas makes their name and docstring appear when doing C-c C-h, which is helpful
+ Getting homebrew without sudo: https://superuser.com/a/1603383
  #+begin_example
  mkdir homebrew && curl -L https://github.com/Homebrew/brew/tarball/master | tar xz --strip 1 -C homebrew
  #+end_example

+ We can use =C-u C-c C-p= to add a =poetry run= prefix to the python start command

* Some good example configs
+ https://gitlab.com/wef/dotfiles/-/blob/master/.emacs.d.minimal/config.el
+ https://gist.github.com/Nathan-Furnal/b327f14e861f009c014af36c1790ec49  <-- python specific

* Notebooking
** EIN:
*** No LSP connect
**** No corfu tab-completion support
**** Interface is clunky
** There is an alpha integration between tangled org mode and lsp-mode
** org-babel-detangle: https://github.com/joaotavora/eglot/issues/523#issuecomment-684528616
** Notebook document support in upcoming LSP specification: https://github.com/joaotavora/eglot/issues/523#issuecomment-1200404642
** Reddit post of getting literate programming to work: https://www.reddit.com/r/emacs/comments/w4f4u3/using_rustic_eglot_and_orgbabel_for_literate/?utm_source=share&utm_medium=web2x&context=3
** Writing the =renz/org-kill-src-block= function
** =org-babel-tangle-jump-to-org= navigates back from a tangled file block to the org file's block

* Blog
** Monte carlo simulation to optimize skating programs
** Org mode, babel, tangling, and untangling
*** Demo using this document?

*** TODO literate programming (ala Jupyter) with Org - builtin, but needs a couple lines of config
We've got a few good examples of python now, and the =Plotting= header
below.  Talk about remote interpreters, inline imaging, and so forth.

** A note on ~semantic-mode~
  This looks like an aborted first attempt at what would eventually
  become the language server protocol.  It flat out doesn't work on
  Windows, even after extensive searches for how to fix it.
** Getting .dir-locals.el to evaluate correct .venv location
#+begin_src elisp
;; .dir-locals.el
((python-mode . ((eval . (let* ((dir-local-found (dir-locals-find-file ".dir-locals.el"))
                                (dir-local-path (if (stringp dir-local-found)
                                                    dir-local-found
                                                  (car dir-local-found)))
                                (dynamic-venv-root (expand-file-name ".venv" dir-local-path)))
                           (setq-local python-shell-virtualenv-root dynamic-venv-root))))))
#+end_src
** Setting up full-time remote development with Python
*** How to get eglot/pyright to play nice over TRAMP
*** The recent remote dir-locals debacle
* Plotting

#+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
| Sede      | Max cites | H-index |
|-----------+-----------+---------|
| Chile     |    257.72 |   21.39 |
| Leeds     |    165.77 |   19.68 |
| Sao Paolo |     71.00 |   11.50 |
| Stockholm |    134.19 |   14.33 |
| Morelia   |    257.56 |   17.67 |

#+PLOT: title:"An evaluation of plaintext document formats" transpose:yes type:radar min:0 max:4
| Format            | Fine-grained-control | Initial Effort | Syntax simplicity | Editor Support | Integrations | Ease-of-referencing | Versatility |
|-------------------+----------------------+----------------+-------------------+----------------+--------------+---------------------+-------------|
| Word              |                    2 |              4 |                 4 |              2 |            3 |                   2 |           2 |
| LaTeX             |                    4 |              1 |                 1 |              3 |            2 |                   4 |           3 |
| Org Mode          |                    4 |              2 |               3.5 |              1 |            4 |                   4 |           4 |
| Markdown          |                    1 |              3 |                 3 |              4 |            3 |                   3 |           1 |
| Markdown + Pandoc |                  2.5 |            2.5 |               2.5 |              3 |            3 |                   3 |           2 |


| Sede          | Max cites |              |
|---------------+-----------+--------------|
| Chile         |    257.72 | WWWWWWWWWWWW |
| Leeds         |    165.77 | WWWWWWWh     |
| Sao Paolo     |     71.00 | WWW;         |
| Stockholm     |    134.19 | WWWWWW:      |
| Morelia       |    257.56 | WWWWWWWWWWWW |
| Rochefourchat |      0.00 |              |
#+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)
